Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter.#ctor(System.Boolean)
Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter
and find elements not contained in any primary design option of any design option set.
inverted:
True if the filter should match all elements which are not contained within a particular design option.
Since:
2011

Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter.#ctor
Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.
Since:
2011

Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter
A filter used to find elements contained in any primary design option of any design option set.
Remarks:
This filter will only pass elements in a primary design option.  It will not pass elements in the main model not associated
to any design option.
This filter is a slow filter.
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
Since:
2011